MrToast99/Nextube-Remaster/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32"

# Flash - 16MB
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHFREQ_40M=y
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# PSRAM - 8MB chip, but the original ESP32 MMU can only map 4MB at a time.
# Setting SPIRAM_SIZE to 4MB caps the driver's mapping attempt to the MMU
# limit and suppresses the "Virtual address not enough for PSRAM" warning.
CONFIG_ESP32_SPIRAM_SUPPORT=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_USE_MALLOC=y
# SPIRAM_MALLOC_ALWAYSINTERNAL threshold — standard malloc/calloc calls whose
# size is ≤ this value are allocated from internal SRAM; calls whose size
# exceeds this value are allocated from PSRAM.
#
# This threshold ONLY applies when mbedTLS uses MBEDTLS_DEFAULT_MEM_ALLOC
# (i.e., plain calloc — set below).  Under MBEDTLS_INTERNAL_MEM_ALLOC (the
# IDF 5.x Kconfig default), mbedTLS calls heap_caps_calloc with
# MALLOC_CAP_INTERNAL, bypassing this threshold entirely and forcing ALL
# allocations to SRAM regardless.
#
# See the "TLS memory strategy" comment further down (near
# CONFIG_MBEDTLS_DEFAULT_MEM_ALLOC) for the full story — why this project
# uses DEFAULT_MEM_ALLOC specifically, and exactly which allocation classes
# (TLS buffers, RSA MPI temporaries, WPA2 crypto, ...) land in PSRAM vs SRAM
# at this threshold value.
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=255
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768
CONFIG_SPIRAM_MEMTEST=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_SIZE=4194304

# CPU frequency
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# Bluetooth — fully disabled (not used; explicit to prevent accidental opt-in)
CONFIG_BT_ENABLED=n

# FreeRTOS
CONFIG_FREERTOS_HZ=1000
# ── FreeRTOS software-timer service task stack ───────────────────────
# 2048 = the ESP-IDF default (Kconfig: default 2048, range 1536-32768).
# This was previously 4096 — double the default, with no recorded reason,
# i.e. the same undocumented defensive padding esp_timer's stack carried
# (see CONFIG_ESP_TIMER_TASK_STACK_SIZE below). That padding is not free:
# internal RAM is the binding constraint on this board (task stacks alone
# total ~140 KB against ~140 KB usable), and unmeasured slack was starving
# task creation elsewhere.
#
# Measured, not guessed: uxTaskGetStackHighWaterMark (per-task telemetry in
# main.c) reported a 576 B peak for "Tmr Svc" across hours of uptime with
# every feature active. 2048 leaves ~3.6x that.
#
# Do NOT push this to the 1536 minimum: this task runs callbacks we don't
# own (WiFi / esp_netif / mDNS software timers), so the measured peak only
# covers callbacks that actually fired, not their worst case. The IDF
# default is the value Espressif tests those against.
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=2048
# Per-task CPU accounting for GET /api/debug/tasks — names the CPU hog when
# IDLE-starvation task-WDT warnings appear (negligible overhead: one esp_timer
# read per context switch).
CONFIG_FREERTOS_USE_TRACE_FACILITY=y
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y
CONFIG_FREERTOS_VTASKLIST_INCLUDE_COREID=y
# Relaxes xTaskCreateStatic()'s pointer-validity check to accept a PSRAM
# buffer, for tasks created via the STATIC path with a caller-supplied
# stack. It does NOT affect xTaskCreate()/xTaskCreatePinnedToCore() (the
# dynamic path almost everything in this codebase uses) — those always
# allocate stacks from internal RAM regardless of this setting. An earlier
# version of this comment claimed otherwise (that ha_mqtt/esp_mqtt's stacks
# "reside in PSRAM" because of this flag); that was disproven both by
# reading ESP-IDF's xTaskCreate source directly and, empirically, by a real
# field investigation where MQTT's task creation failed specifically from
# internal-RAM fragmentation — impossible if the stack were actually in
# PSRAM. Keep this enabled only if something is actually using (or will
# use) the static+external-stack path; it isn't a blanket "PSRAM for
# stacks" switch.
CONFIG_SPIRAM_ALLOW_STACK_EXTERNAL_MEMORY=y

# app_main()'s own task defaults to priority 1 (ESP-IDF default) — LOWER
# than several tasks it creates (display=6, mic/ntp=5, ...). FreeRTOS is
# fully preemptive: the instant xTaskCreate() for a higher-priority task
# succeeds, that task can preempt app_main() mid-sequence, before it
# finishes creating whatever comes later in its own list. Confirmed live:
# sht30_task (4 KB) and audio_play_task (16 KB), both created after
# ha_mqtt_start() (priority 3) in main.c, failed within 15 s of boot —
# ha_mqtt_task's immediate client-init/connect work (no longer gated behind
# a WiFi-connect wait) ran and committed its own footprint in the gap
# before app_main() got scheduled again to finish its list. Raising this
# above every priority app_main() creates (7, one above display's 6) makes
# task creation in main.c a true atomic batch again, instead of one that
# can be interrupted by whatever it just created.
#
# Trade-off: display_task (6) currently renders its first frames WHILE
# app_main() is still running the rest of boot (WiFi init, web server, the
# remaining task creations) — that's why the tubes come alive partway
# through boot in every log, not only at the very end. With main_task
# outranking it too, display won't get scheduled at all until app_main()
# fully returns, so the tubes stay blank a few seconds longer at every
# boot. One-time cost, not a recurring one — accepted in exchange for
# task creation no longer racing itself.
CONFIG_ESP_MAIN_TASK_PRIORITY=7

# Wi-Fi
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=y
# Double the TX buffer pool (default 32) so TLS handshake packets and
# concurrent HTTP responses don't compete and cause EAGAIN on sends.
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=64

# HTTP Server
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=512

# Watchdog
CONFIG_ESP_TASK_WDT_TIMEOUT_S=30

# Log level
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y

# OTA
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# mDNS
CONFIG_MDNS_MAX_SERVICES=10
# Disable predefined (auto) mDNS registration for the AP netif.
# By default IDF 5.x mDNS auto-registers every netif (STA, AP, ETH) when it
# comes up.  We never want the setup AP ("Nextube-Setup") advertised on the
# LAN, so its predefined registration is disabled here — the AP interface is
# never presented to LAN-side mDNS resolvers.
CONFIG_MDNS_PREDEF_NETIF_AP=n
# Disable predefined (auto) mDNS registration for the STA netif.
# wifi_manager.c registers the STA netif explicitly via mdns_register_netif()
# after mdns_init(), and drives the probe/announce cycle from the
# IP_EVENT_STA_GOT_IP handler:
#
#   • New IP (boot, DHCP reassign, new network) → ENABLE_IP4: full
#     probe + announce so the device is advertised on the LAN.
#   • Same IP (reconnect on the same DHCP lease) → ANNOUNCE_IP4: re-announce
#     without re-probing (the hostname claim hasn't changed).
#
# Keeping auto-registration off gives a single, explicit registration path
# rather than also having the daemon install its own LWIP netif-ext callback
# on IP-address changes.  In the 2025 refactored espressif/mdns component the
# explicit mdns_register_netif() call is a pure registry operation: it stores
# the netif pointer in a free slot and installs NO callbacks and NO esp-event
# handlers.  (Without that explicit call, get_if_from_netif() can't find the
# netif and mdns_netif_action() returns ESP_ERR_INVALID_STATE — mDNS would
# never announce.)
CONFIG_MDNS_PREDEF_NETIF_STA=n

# LWIP netif default hostname.
# This controls the name the device uses in DHCP client requests (option 12)
# and is the hostname the mDNS stack reads from the netif during mdns_init().
# Without this, the netif hostname defaults to "espressif", causing the device
# to announce itself as "espressif.localdomain" on the LAN and send mDNS probes
# with "espressif" before mdns_hostname_set() (which is async) takes effect.
# The start_mdns() function also calls esp_netif_set_hostname() at runtime to
# apply the user-configured hostname from config; this default ensures the very
# first probe — fired the moment mdns_init() starts the task — is already
# correct even before that runtime call executes.
CONFIG_LWIP_LOCAL_HOSTNAME="nextube-remaster"

# TLS / HTTPS
# Enable the built-in Mozilla CA certificate bundle so esp_crt_bundle_attach()
# works in the weather HTTP client.  Without this the bundle is empty and
# esp-tls rejects the connection with "No server verification option set".
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
# Partial bundle (~30 KB, ~40 curated CAs).
# The full bundle (~70 KB, 150+ CAs) is unnecessary — all APIs used by this
# project (Met.no, Open-Meteo, Nominatim, OpenWeatherMap, wttr.in, YouTube,
# Instagram, TikTok, Mastodon) root at CAs in the partial bundle.  The
# smaller binary reduces flash usage and speeds up bundle search during cert
# verification.
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_PARTIAL=y
#
# TLS I/O buffer sizing.
# IN must stay at 16 384 — Met.no sends TLS records that fill the maximum
# record size; mbedtls_ssl_read returns -0x7100 (CONN_EOF) with anything
# smaller.  OUT can safely be 4 096: device→server HTTP requests are always
# well under 4 KB.
CONFIG_MBEDTLS_SSL_IN_CONTENT_LEN=16384
CONFIG_MBEDTLS_SSL_OUT_CONTENT_LEN=4096
#
# TLS memory strategy.
#
# ── Root cause of 0x4290 (MBEDTLS_ERR_RSA_PUBLIC_FAILED | MPI_ALLOC_FAILED) ──
#
# IDF 5.5.3 Kconfig defaults MBEDTLS_MEM_ALLOC_MODE to MBEDTLS_INTERNAL_MEM_ALLOC.
# In that mode, esp_mbedtls_mem_calloc() calls:
#   heap_caps_calloc(n, size, MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT)
# This is an EXPLICIT internal-SRAM request that completely bypasses the
# SPIRAM_MALLOC_ALWAYSINTERNAL threshold.  ALL mbedTLS allocations — including
# the 16 KB TLS IN buffer, the 4 KB OUT buffer, and every 512-byte RSA-4096 MPI
# limb array — go to internal SRAM, not PSRAM.
#
# Without MQTT: SRAM had just enough room for two sequential TLS sessions
# (geocoding + weather) plus RSA temporaries.
#
# With MQTT enabled: the MQTT TCP PCB, event queues, and task TCBs add ~1–2 KB
# of small SRAM allocations.  Those scattered allocations fragment SRAM such
# that after the geocoding TLS session allocates-then-frees its 20 KB of
# mbedTLS buffers, the freed blocks cannot fully coalesce.  The Met.no TLS
# session begins, ssl_setup() gets the 16 KB + 4 KB it needs from the re-used
# block, but by the time certificate verification reaches mbedtls_mpi_exp_mod()
# the remaining contiguous SRAM is too small for the RSA MPI temporaries →
# MBEDTLS_ERR_MPI_ALLOC_FAILED → MBEDTLS_ERR_RSA_PUBLIC_FAILED = 0x4290.
#
# ── Fix ──────────────────────────────────────────────────────────────────────
#
# Select MBEDTLS_DEFAULT_MEM_ALLOC ("Default alloc mode").  In this mode
# esp_mbedtls_mem_calloc() calls plain calloc(n, size), which goes through
# IDF's SPIRAM-aware heap (CONFIG_SPIRAM_USE_MALLOC=y).  Allocations whose
# size exceeds SPIRAM_MALLOC_ALWAYSINTERNAL=255 are served from PSRAM; smaller
# allocations stay in SRAM.  Effect on each allocation class:
#
#   Allocation                  Size     Result with DEFAULT + threshold=255
#   ──────────────────────────  ───────  ───────────────────────────────────
#   TLS IN  buffer              16 384 B > 255 → PSRAM (4 MB free)   ✓
#   TLS OUT buffer               4 096 B > 255 → PSRAM               ✓
#   RSA-4096 MPI limb array        512 B > 255 → PSRAM               ✓
#   RSA-2048 MPI limb array        256 B > 255 → PSRAM               ✓
#   mbedtls_aes_context           ~280 B > 255 → PSRAM               ✓
#     (hardware AES loads key regs via CPU writes, not DMA — PSRAM is safe)
#   WPA2 PSK crypto buffers      ≤ 120 B ≤ 255 → SRAM (DMA-safe)    ✓
#   FreeRTOS TCBs / mutexes      ≤ 200 B ≤ 255 → SRAM               ✓
#
# MBEDTLS_EXTERNAL_MEM_ALLOC was also considered but rejected: it forces ALL
# mbedTLS allocations to PSRAM via heap_caps_calloc(..., MALLOC_CAP_SPIRAM),
# including the WPA2/WPA3 supplicant's AES/SHA context buffers.  On original
# ESP32 the hardware crypto engines access those buffers via DMA, which
# requires MALLOC_CAP_DMA (= internal SRAM).  Routing them to PSRAM causes
# the supplicant to fail → DNS error 202 after Wi-Fi connects.  DEFAULT mode
# avoids this because the threshold keeps small (<= 255 B) supplicant buffers
# in internal SRAM.
#
# MBEDTLS_DYNAMIC_BUFFER was tested and rejected: its "Dynamic Impl" path
# uses heap_caps_malloc(MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT) explicitly for
# the record buffers, keeping them in SRAM regardless of this setting.
#
CONFIG_MBEDTLS_DEFAULT_MEM_ALLOC=y
#
# Hardware RSA accelerator — ENABLED.
# With DEFAULT_MEM_ALLOC + ALWAYSINTERNAL=255, hardware RSA's staging buffers
# (allocated via mbedtls_calloc → calloc → SPIRAM-aware) land in PSRAM, which
# is safe for the ESP32 hardware RSA peripheral: it receives operands via CPU
# register writes (cache-mediated reads from PSRAM), NOT DMA — so the
# PSRAM-split has no bearing on it.  (The historical PSRAM-related TLS
# failures were allocator-mode problems: INTERNAL_MEM_ALLOC fragmentation
# → 0x4290, and EXTERNAL_MEM_ALLOC breaking the supplicant's DMA buffers —
# both documented above and both fixed by DEFAULT_MEM_ALLOC + threshold.)
#
# Why enabled: software RSA-4096 takes ~200–400 ms per public-key operation
# (vs ~50 ms hardware).  A TLS handshake performs several, and on a cold boot
# — DNS cold, router DHCP/ARP fresh, display + NTP + MQTT + social fetches
# all competing — the weather client's 5 s fail-fast timeout was intermittently
# exceeded ("esp-tls: Failed to open new connection in specified timeout" at
# ~52 s, first fetch after WiFi).  Hardware RSA cuts the handshake's crypto
# cost ~4–8×, keeping the first fetch inside its timeout.
# If TLS verification ever fails consistently with this enabled, revert to =n.
CONFIG_MBEDTLS_HARDWARE_MPI=y

# MQTT
# Currently dead: components/ha_mqtt/ha_mqtt.c sets .task.stack_size=10240
# explicitly in esp_mqtt_client_config_t, which overrides this Kconfig
# default at runtime — see that file's comment for why (measured peak usage,
# and the field-confirmed task-creation-vs-fragmentation history). This value
# only takes effect if that explicit override is ever removed. Also does NOT
# place the stack in PSRAM regardless of SPIRAM_ALLOW_STACK_EXTERNAL_MEMORY —
# see that flag's comment above; this is real internal RAM either way.
CONFIG_MQTT_TASK_STACK_SIZE=4096

# LWIP
CONFIG_LWIP_MAX_SOCKETS=32
CONFIG_LWIP_SNTP_MAX_SERVERS=4

# NVS
CONFIG_NVS_ENCRYPTION=n

# ── IRAM optimisation ─────────────────────────────────────────────────
# IRAM overflows by ~5 KB when esp_jpeg + WiFi + BT all load.
# Move non-ISR-critical code to flash to free headroom.

# FreeRTOS tick hook and utility functions don't need to be in IRAM.
CONFIG_FREERTOS_PLACE_FUNCTIONS_INTO_FLASH=y

# Pixel blits use spi_device_transmit (interrupt/DMA path) to yield the CPU
# during large transfers, reducing the sustained current the CPU+SPI combination
# draws from the shared 3.3 V rail — the main firmware-accessible lever for SPI
# induced audio noise.  The SPI ISR is kept in flash (not IRAM) to preserve the
# limited IRAM budget; ISR latency is acceptable since display renders are not
# timing-critical at 5 Hz / 50 ms.
CONFIG_SPI_MASTER_ISR_IN_IRAM=n

# Ring-buffer ISR and helper functions (used by RMT LED driver and I2S)
# can live in flash; latency is acceptable for our use case.
CONFIG_RINGBUF_PLACE_FUNCTIONS_INTO_FLASH=y
CONFIG_RINGBUF_PLACE_ISR_FUNCTIONS_INTO_FLASH=y

# ── esp_timer service task stack ─────────────────────────────────────
# 3584 = the ESP-IDF default (Kconfig: default 3584, range 2048-65536).
# This was 8192, bumped while the mic sampled via esp_timer callbacks —
# that reason is gone (replaced by adc_continuous DMA, see microphone.c) —
# and was then kept purely as "cheap insurance". It is not cheap: internal
# RAM is the binding constraint on this board (task stacks alone total
# ~140 KB against ~140 KB usable), and that spare 4.5 KB was contributing
# to task-creation failures elsewhere.
#
# Measured, not guessed: uxTaskGetStackHighWaterMark (per-task telemetry
# in main.c) reported a peak of 400 B used across ~2 h of uptime with
# every feature active — LEDC fades and WiFi internals included. 3584
# leaves ~8x the observed peak.
#
# Do NOT push this to the 2048 minimum: this task dispatches callbacks we
# don't own (IDF internals, LEDC fades, WiFi), so the measured peak only
# covers callbacks that actually fired, not their worst case — and it runs
# at priority 22, where an overflow corrupts silently rather than failing
# cleanly. The IDF default is the value Espressif tests those against.
CONFIG_ESP_TIMER_TASK_STACK_SIZE=3584

# LittleFS — store mtime as a per-file extended attribute so stat() returns a
# real modification timestamp.  Each file written after this build gets an
# accurate upload/write time; files already on the FS show mtime=0 until
# rewritten.  Costs ~4 bytes of extended-attribute storage per file.
CONFIG_LITTLEFS_MTIME=y

